In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
USE zomato

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [3]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('categories',),
 ('customers',),
 ('items',),
 ('order_items',),
 ('orders',),
 ('payments',)]

In [4]:
%%sql
SELECT SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('1000.00'),)]

In [5]:
%%sql
SELECT i.item_name, SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
GROUP BY i.item_name
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Butter Chicken', Decimal('600.00')),
 ('Biriyani', Decimal('300.00')),
 ('Paneer', Decimal('100.00'))]

In [6]:
%%sql
SELECT p.payment_method, SUM(p.amount) AS total_revenue
FROM payments p
JOIN orders o ON p.order_id = o.order_id
GROUP BY p.payment_method;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Credit Card', Decimal('300.00')),
 ('Debit Card', Decimal('100.00')),
 ('GPay', Decimal('600.00'))]

In [7]:
%%sql
SELECT DATE(p.paid_at) AS date, SUM(p.amount) AS daily_revenue
FROM payments p
GROUP BY DATE(p.paid_at)
ORDER BY date;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(datetime.date(2025, 9, 17), Decimal('1000.00'))]

In [18]:
%%sql
SELECT 
    u.first_name,
    u.last_name,
    u.phone_number,
    u.email,
    COUNT(o.order_id) AS total_orders,
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN users u ON o.user_id = u.user_id
GROUP BY u.user_id
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Rohit', 'Singh', '9876023456', 'rohit.singh@example.com', 1, Decimal('600.00')),
 ('Amit', 'Kumar', '9876001234', 'amit.kumar@example.com', 1, Decimal('300.00')),
 ('Sneha', 'Patel', '9876012345', 'sneha.patel@example.com', 1, Decimal('100.00'))]

In [9]:
%%sql
SELECT c.category_name, i.item_name, SUM(oi.quantity) AS total_quantity_ordered
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
JOIN categories c ON i.category_id = c.category_id
GROUP BY c.category_name, i.item_name
ORDER BY total_quantity_ordered DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Non-Vegetarian', 'Butter Chicken', Decimal('3')),
 ('Non-Vegetarian', 'Biriyani', Decimal('2')),
 ('Vegetarian', 'Paneer', Decimal('1'))]

In [10]:
%%sql
SELECT p.payment_status, COUNT(o.order_id) AS total_orders
FROM payments p
JOIN orders o ON p.order_id = o.order_id
GROUP BY p.payment_status;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('Paid', 2), ('Pending', 1)]

In [19]:
%%sql
SELECT 
    u.first_name, 
    u.last_name, 
    COUNT(o.order_id) AS total_orders
FROM users u
JOIN orders o ON u.user_id = o.user_id
GROUP BY u.user_id
ORDER BY total_orders DESC
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Amit', 'Kumar', 1), ('Sneha', 'Patel', 1), ('Rohit', 'Singh', 1)]

In [12]:
%%sql
SELECT c.category_name, SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
JOIN categories c ON i.category_id = c.category_id
GROUP BY c.category_name;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('Non-Vegetarian', Decimal('900.00')), ('Vegetarian', Decimal('100.00'))]

In [13]:
%%sql
SELECT oi.order_id, i.item_name, oi.quantity, oi.price
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
WHERE oi.order_id = 1;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 'Biriyani', 2, Decimal('150.00'))]

In [14]:
%%sql
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    o.order_id, 
    o.delivery_address, 
    oi.item_id, 
    oi.quantity
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers c ON o.user_id = c.user_id;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('John', 'Doe', '123-456-7890', 'john.doe@example.com', 1, '123 Main St', 1, 2),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 2, '456 Oak Rd', 2, 1),
 ('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 3, '789 Pine Ave', 3, 3)]

In [15]:
%%sql
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers c ON o.user_id = c.user_id
GROUP BY c.user_id
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', Decimal('600.00')),
 ('John', 'Doe', '123-456-7890', 'john.doe@example.com', Decimal('300.00')),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', Decimal('100.00'))]

In [16]:
%%sql
DROP TABLE users;
CREATE TABLE users (
    user_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100),
    phone_number VARCHAR(20),
    email VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [17]:
%%sql
INSERT INTO users (first_name, last_name, phone_number, email)
VALUES 
('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com'),
('John', 'Doe', '123-456-7890', 'john.doe@example.com 	'),
('Rohit', 'Singh', '9876023456', 'rohit.singh@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]